Revit 2027 API
IFCOpeningData.IsRecess Property
 Trus if it is a recess, false if it is an opening.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRecess { get; }
Public ReadOnly Property IsRecess As Boolean
	Get
public:
property bool IsRecess {
	bool get ();
}
member IsRecess : bool with get
Property Value
Boolean
See Also
Reference
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace